{{- if ne .hostname "macbook-air-m2" -}}
brew "r"
cask "fiji" if OS.mac?
cask "iterm2"
cask "notion" if OS.mac?
cask "visual-studio-code"
mas "AusweisApp Bund", id: 948660805
mas "Infuse", id: 1136220934
mas "NordVPN: VPN Fast & Secure", id: 905953485
mas "Notion Web Clipper", id: 1559269364
mas "Save to Raindrop.io", id: 1549370672
mas "Speedtest by Ookla", id: 1153157709
mas "Structured: Daily Planner Todo", id: 1499198946
mas "WhatsApp Messenger", id: 310633997
{{- end -}}

tap "apple/apple"
tap "jandedobbeleer/oh-my-posh"
tap "teamookla/speedtest"
brew "cairo"
brew "coreutils"
brew "gh"
brew "htop"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "libxt"
brew "mas"
brew "mise"
brew "pcre2"
brew "rclone"
brew "teamookla/speedtest/speedtest"
brew "xz"
cask "chromedriver"
cask "firefox"
cask "font-meslo-lg-nerd-font"
cask "notion-cli"
cask "xquartz"
vscode "bitwisecook.tcl-lsp"
vscode "eamodio.gitlens"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "hverlin.mise-vscode"
vscode "jinliming2.vscode-go-template"
vscode "lextudio.restructuredtext-pack"
vscode "marimo-team.vscode-marimo"
vscode "mathematic.vscode-pdf"
vscode "mathworks.language-matlab"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "nextflow.nextflow"
vscode "onnovalkering.vscode-singularity"
vscode "redhat.vscode-yaml"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "snakemake.snakemake-lang"
vscode "tamasfe.even-better-toml"
vscode "task.vscode-task"
vscode "timonwong.shellcheck"
vscode "tyriar.sort-lines"
vscode "wekex.jsonlint"
vscode "yzane.markdown-pdf"